src/assets/docs/content/argentina-ar/snp/reversardebitos.json

{
  "slug": "argentina-ar/snp/reversardebitos",
  "pageTitle": "Reversar Débitos",
  "description": "Método para solicitar el reverso de un débito indicado.",
  "pubName": "BTSNP.ReversarDebitos",
  "programa": "RBTPG336",
  "scope": "Argentina",
  "hasBackendConfig": false,
  "backendText": "",
  "backendData": [],
  "inputData": [
    {
      "Nombre": "prestacion",
      "Tipo": "String",
      "Comentarios": "Identificador de prestación."
    },
    {
      "Nombre": "empresaOriginante",
      "Tipo": "String",
      "Comentarios": "Identificador de la empresa originante."
    },
    {
      "Nombre": "clienteUId",
      "Tipo": "Long",
      "Comentarios": "Identificador único del cliente."
    },
    {
      "Nombre": "idCliente",
      "Tipo": "String",
      "Comentarios": "Identificador del Cliente SNP."
    },
    {
      "Nombre": "tipoDeDebito",
      "Tipo": "Byte",
      "Comentarios": "Tipo de débito (1=Abierto/2=Cerrado)."
    },
    {
      "Nombre": "fechaVencimiento",
      "Tipo": "Date",
      "Comentarios": "Fecha de vencimiento."
    },
    {
      "Nombre": "referencia",
      "Tipo": "String",
      "Comentarios": "Referencia del débito."
    }
  ],
  "outputData": [],
  "errors": [
    {
      "Código": "30001",
      "Descripción": "No se recibió identificador del cliente."
    },
    {
      "Código": "30002",
      "Descripción": "No se recibió el identificador de la empresa originante."
    },
    {
      "Código": "30003",
      "Descripción": "No se recibió el tipo de débito."
    },
    {
      "Código": "30004",
      "Descripción": "No se recibió la prestación."
    },
    {
      "Código": "30005",
      "Descripción": "No se recibió el ID del cliente SNP."
    },
    {
      "Código": "30006",
      "Descripción": "No se recibió la fecha de vencimiento."
    },
    {
      "Código": "30007",
      "Descripción": "El tipo de débito no es correcto."
    },
    {
      "Código": "30008",
      "Descripción": "No se encontró un cliente para el identificador: [Número de identificador]."
    },
    {
      "Código": "40001",
      "Descripción": "No se puede realizar el reverso debido al tiempo de transcurrido desde la fecha de vencimiento."
    },
    {
      "Código": "40002",
      "Descripción": "No se puede reversar el débito el mismo dia de contabilizado."
    },
    {
      "Código": "40003",
      "Descripción": "Débito no contabilizado."
    },
    {
      "Código": "40004",
      "Descripción": "No existe el débito recibido."
    },
    {
      "Código": "40011",
      "Descripción": "Ya existe un reverso en curso"
    }
  ],
  "examples": {
    "invocation": {
      "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:bts=\"http://uy.com.dlya.bantotal/BTSOA/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <bts:BTSNP.ReversarDebito>\r\n         <bts:Btinreq>\r\n            <bts:Canal>BTDIGITAL</bts:Canal>\r\n            <bts:Requerimiento>1</bts:Requerimiento>\r\n            <bts:Usuario>BANTOTAL</bts:Usuario>\r\n            <bts:Token>e8c844e3a0F955E77534D3E0</bts:Token>\r\n            <bts:Device>AC</bts:Device>\r\n         </bts:Btinreq>\r\n         <bts:clienteUId>2</bts:clienteUId>\r\n         <bts:empresaOriginante>3050001626</bts:empresaOriginante>\r\n         <bts:tipoDeDebito>1</bts:tipoDeDebito>\r\n         <bts:prestacion>DEB RIO</bts:prestacion>\r\n         <bts:idCliente>2750101598490000002000</bts:idCliente>\r\n         <bts:fechaVencimiento>2019-11-20</bts:fechaVencimiento>\r\n         <bts:referencia>015984900000216</bts:referencia>\r\n      </bts:BTSNP.ReversarDebito>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
      "json": "curl -X POST \\\r\n  'http://btd-bantotal.eastus2.cloudapp.azure.com:4462/btdeveloper/servlet/com.dlya.bantotal.odwsbt_BTSNP_v1?ObtenerEmpresasOriginantes' \\\r\n  -H 'cache-control: no-cache' \\\r\n  -H 'content-type: application/json' \\\r\n  -H 'postman-token: 6b958b92-122d-189b-a0b5-7a4a0569b79d' \\\r\n  -d '{   \r\n\t\t\"Btinreq\": {\r\n\t\t\t\"Device\": \"AC\",\r\n\t\t\t\"Usuario\": \"BANTOTAL\",\r\n\t\t\t\"Requerimiento\": \"\",\r\n\t\t\t\"Canal\": \"BTDIGITAL\",\r\n\t\t\t\"Token\": \"e8c844e3a0F955E77534D3E0\"\r\n\t\t},\r\n\t\t\"clienteUId\": 2,\r\n\t\t\"empresaOriginante\": \"3050001626\",\r\n\t\t\"tipoDeDebito\": 1,\r\n\t\t\"prestacion\": \"DEB RIO\",\r\n\t\t\"idCliente\": \"2750101598490000002000\",\r\n\t\t\"fechaVencimiento\": \"2019-11-20\",\r\n\t\t\"referencia\": \"015984900000216\"\r\n\t}"
    },
    "response": {
      "xml": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:SOAP-ENC=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\r\n   <SOAP-ENV:Body>\r\n      <BTSNP.ReversarDebitoResponse xmlns=\"http://uy.com.dlya.bantotal/BTSOA/\">\r\n         <Btinreq>\r\n            <Device>AC</Device>\r\n            <Usuario>BANTOTAL</Usuario>\r\n            <Requerimiento>1</Requerimiento>\r\n            <Canal>BTDIGITAL</Canal>\r\n            <Token>e8c844e3a0F955E77534D3E0</Token>\r\n         </Btinreq>\r\n         <Erroresnegocio></Erroresnegocio>\r\n         <Btoutreq>\r\n            <Numero>1632</Numero>\r\n            <Servicio>BTSNP.ReversarDebito</Servicio>\r\n            <Estado>OK</Estado>\r\n            <Fecha>2021-06-18</Fecha>\r\n            <Requerimiento>1</Requerimiento>\r\n            <Canal>BTDIGITAL</Canal>\r\n            <Hora>11:16:42</Hora>\r\n         </Btoutreq>\r\n      </BTSNP.ReversarDebitoResponse>\r\n   </SOAP-ENV:Body>\r\n</SOAP-ENV:Envelope>",
      "json": ""
    }
  },
  "structuredTypes": [],
  "valuesTable": []
}